{"news":[{"date":"Jul 2025","year":"2025","color":"#6fd2ab","content":"I presented work on interpreting generated enzymes at the <a href=\"https://www.grc.org/enzymes-coenzymes-and-metabolic-pathways-conference/2024/\">Enzymes, Coenzymes, and Metabolic Pathways Gordon Research Conference</a> in New Hampshire, where I was selected as the graduate student speaker for the meeting.","type":"award"},{"date":"Apr 2025","year":"2025","color":"#6fd2ab","content":"I presented work on microfluidic genetic code expansion at the <a href=\"https://www.varianteffect.org/mss2025/\">Mutational Scanning Symposium</a> in Barcelona, Spain.","type":"conference"},{"date":"Apr 2025","year":"2025","color":"#6fd2ab","content":"I gave a lightning talk at the <a href=\"https://www.czbiohub.org/sf/\">Chan Zuckerberg Biohub's</a> Interlab Confabulation in San Francisco, CA.","type":"talk"},{"date":"Apr 2025","year":"2025","color":"#6fd2ab","content":"I presented recent work on a microfluidic strategy for efficient genetic code expansion at the NHGRI Trainee Meeting in Philadelphia, PA.","type":"conference"},{"date":"Jul 2024","year":"2024","color":"#ea7e40","content":"At the <a href=\"https://www.grc.org/enzymes-coenzymes-and-metabolic-pathways-conference/2024/\">Coenzymes, and Metabolic Pathways Gordon Research Conference</a> in New Hampshire, I presented work on generative design of acylphosphatases and won some travel money from ACS.","type":"award"},{"date":"Aug 2023","year":"2023","color":"#e401c2","content":"I had a great time presenting my work on characterizing designed acylphosphatases at the <a href=\"https://med.stanford.edu/genetics/events/CIG.html\">Current Issues in Genetics (CIG)</a> seminar series in the Stanford Genetics Department.","type":"talk"},{"date":"Jul 2023","year":"2023","color":"#e401c2","content":"I'm very grateful to receive a NRSA F31 fellowship from the <a href=\"https://www.genome.gov/careers-training/NHGRI-Funding-Opportunities-Training-Career-Development/Fellowships-FAQ\">National Human Genome Research Institute</a> to support my research on sequence-to-function relationships in enzymes!","type":"fellowship"},{"date":"Dec 2022","year":"2022","color":"#1bb300","content":"During the NeurIPS <a href=\"https://www.lmrl.org/\">Learning Meaningful Representations of Life workshop</a> Clara Wong-Fannjiang and I presented our work on using protein language models to enhance thermostability and activity of acylphosphatases (<a href=\"https://openreview.net/forum?id=Nc7EsfpZ7C\">Poster</a>).","type":"conference"},{"date":"Sep 2022","year":"2022","color":"#1bb300","content":"At this year's Genetics Department retreat, I presented a strategy to characterize a large library of enzymes designed by a newly-described protein language model (<a href=\"https://micaholivas.me/public/2022-olivas-genetics-retreat-poster-final.pdf\">PDF</a>).","type":"conference"},{"date":"Nov 2021","year":"2021","color":"#5900ff","content":"I passed my qualifying exam in the Genetics Department!","type":"milestone"},{"date":"Sep 2021","year":"2021","color":"#5900ff","content":"I presented my rotation project in the Fordyce lab, in which I generated high-throughput kinetic measurements of human acylphosphatases (<a href=\"https://micaholivas.me/public/2021-olivas-genetics-retreat-poster-final.pdf\">PDF</a>) at the Stanford Genetics Department Retreat.","type":"conference"},{"date":"Jul 2021","year":"2021","color":"#5900ff","content":"I am thrilled to join <a href=\"http://www.fordycelab.com/\">Polly Fordyce's group</a> in the Departments of Genetics and Bioengineering! I will continue to work with the high-throughput enzymology team on a project I started at the beginning of my rotation in May.","type":"milestone"},{"date":"Apr 2021","year":"2021","color":"#5900ff","content":"After spending the winter quarter with <a href=\"https://web.stanford.edu/group/steinmetzlab/cgi-bin/wordpress/?page_id=59\">Serena Sanulli's group</a>, I will be moving on to another rotation with Polly Fordyce's group. It was great to witness the formative weeks of Serena's lab at Stanford.","type":"rotation"},{"date":"Feb 2021","year":"2021","color":"#5900ff","content":"My rotation in the <a href=\"https://web.stanford.edu/group/steinmetzlab/cgi-bin/wordpress/?page_id=59\">Steinmetz Lab</a> has come to an end. I had a great time working on the TAP-seq pipeline with Andreas Gschwind, Dan Schraivogel, and others.","type":"rotation"},{"date":"May 2020","year":"2020","color":"#bf1e4f","content":"I was awarded a <a href=\"https://www.phikappaphi.org/grants-awards/undergraduate-students/fellowship#.XyNzfBNKgUo\">graduate fellowship</a> from the <a href=\"https://www.phikappaphi.org/\">Honor Society of Phi Kappa Phi</a>!","type":"fellowship"},{"date":"Apr 2020","year":"2020","color":"#bf1e4f","content":"After a round of socially-distanced interviews, I accepted an offer to join <a href=\"https://therapeutics.23andme.com/\">23andMe Therapeutics</a> as a Target Biology Intern for Summer 2020.","type":"internship"},{"date":"Mar 2020","year":"2020","color":"#bf1e4f","content":"New work on pooled CRISPR screens in an organoid model of lung cancer is out now in <a href=\"papers/2020_Nature.pdf\">Nature</a>! We demonstrate that 3D \"spheroid\" cultures of lung adenocarcinoma resolve phenotypic defects that arise in 2D monoloayer cell culture and apply genome-wide forward screens in these models to identify genes implicated in tumor growth regulation.","type":"publication"}]}